## Pandas Series and DataFrame

Pandas Series : one diamental labled data , capable og holding any datatype  
yaha index  ke sath data hota yaha ke index ko label bolte h
vetically agr data ko stack krte to series bolte

## Creating Series

In [43]:
import numpy as np 
import pandas as pd

In [44]:
labels = ['a','b','c']
my_list = [10,20,30]
arr = np.array([10,20,30])
d= {1:10 , 2:20, 3:30}

In [45]:
pd.Series(my_list )

0    10
1    20
2    30
dtype: int64

In [46]:
pd.Series(my_list , index=labels)

a    10
b    20
c    30
dtype: int64

In [47]:
# dictionary se direct series bn jata 
pd.Series(d)

1    10
2    20
3    30
dtype: int64

# DATA FRAME 
 when we combine multiple series jisko hum data frame bolte hai

Creating a DataFrame

In [48]:
data={
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [20, 21, 22, 23],
    'City': ['NewYork', 'Paris', 'Berlin', 'London'],
    'Salary': [6000, 7000, 8000, 9000]
}

In [49]:
pd.DataFrame(data)

    Name  Age     City  Salary
0   John   20  NewYork    6000
1   Anna   21    Paris    7000
2  Peter   22   Berlin    8000
3  Linda   23   London    9000

In [69]:
data_list=[
    ['John', 'Anna', 'Peter', 'Linda'],
    [20, 21, 22, 23],
    ['NewYork', 'Paris', 'Berlin', 'London'],
     [6000, 7000, 8000, 9000]
]

df2= pd.DataFrame(data_list)
col= ['Name', 'Age', 'City', 'Salary']

In [51]:
df2

         0      1       2       3
0     John   Anna   Peter   Linda
1       20     21      22      23
2  NewYork  Paris  Berlin  London
3     6000   7000    8000    9000

In [71]:
df2=pd.DataFrame(data_list , columns=col)
df2

      Name    Age    City  Salary
0     John   Anna   Peter   Linda
1       20     21      22      23
2  NewYork  Paris  Berlin  London
3     6000   7000    8000    9000

# selection and indexing columns

In [53]:
df2

      Name    Age    City  Salary
0     John   Anna   Peter   Linda
1       20     21      22      23
2  NewYork  Paris  Berlin  London
3     6000   7000    8000    9000

In [54]:
# yaha columns axis krne ke liye   (3,3)  aisi type ka indexing nhi lgta 

df2[['Name' , 'Age']]  # direct lable ya column name se kr skte h

      Name    Age
0     John   Anna
1       20     21
2  NewYork  Paris
3     6000   7000

# new column creation

In [55]:
df2["Designation"]= ['Dr',"Engineer","lower","bussiness man"]

df2

      Name    Age    City  Salary    Designation
0     John   Anna   Peter   Linda             Dr
1       20     21      22      23       Engineer
2  NewYork  Paris  Berlin  London          lower
3     6000   7000    8000    9000  bussiness man

# remove a column

In [56]:
# ye drop krega column wise aur show bs krta but actual me remove nhi hota 
df2.drop('Designation', axis=1)

      Name    Age    City  Salary
0     John   Anna   Peter   Linda
1       20     21      22      23
2  NewYork  Paris  Berlin  London
3     6000   7000    8000    9000

In [57]:
# see designation wla fir aagya 
df2

      Name    Age    City  Salary    Designation
0     John   Anna   Peter   Linda             Dr
1       20     21      22      23       Engineer
2  NewYork  Paris  Berlin  London          lower
3     6000   7000    8000    9000  bussiness man

In [58]:
# to isko over come krne ke liye  inplace krke true krna hoga 

df2.drop( [ "Age","City"], axis=1, inplace=True)
df2

      Name  Salary    Designation
0     John   Linda             Dr
1       20      23       Engineer
2  NewYork  London          lower
3     6000    9000  bussiness man

In [59]:
# to isko over come krne ke liye  inplace krke true krna hoga 

df2.drop( 0, axis=0, inplace=True )
df2

      Name  Salary    Designation
1       20      23       Engineer
2  NewYork  London          lower
3     6000    9000  bussiness man

#  accesing  and Selecting data

In [60]:
# ye labeld locaiton ke based me deta 
df2.loc[[1,2]]

      Name  Salary Designation
1       20      23    Engineer
2  NewYork  London       lower

In [61]:
# ye index lcoaiton ke based me deta 
df2.iloc[0]

Name                 20
Salary               23
Designation    Engineer
Name: 1, dtype: object

In [66]:
df2.loc[[1,2]][['Salary','Designation']]

   Salary Designation
1      23    Engineer
2  London       lower

In [67]:
df2.loc[[1,2]][['Name']]

      Name
1       20
2  NewYork

In [73]:
df2

      Name    Age    City  Salary
0     John   Anna   Peter   Linda
1       20     21      22      23
2  NewYork  Paris  Berlin  London
3     6000   7000    8000    9000

## Conditional Selection

In [76]:
data={
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [20, 21, 22, 23],
    'City': ['NewYork', 'Paris', 'Berlin', 'London'],
    'Salary': [6000, 7000, 8000, 9000]
}

df = pd.DataFrame(data)
df

    Name  Age     City  Salary
0   John   20  NewYork    6000
1   Anna   21    Paris    7000
2  Peter   22   Berlin    8000
3  Linda   23   London    9000

i only want t osee who's age is above 30

In [82]:
df[df["Age"]>20]

    Name  Age    City  Salary
1   Anna   21   Paris    7000
2  Peter   22  Berlin    8000
3  Linda   23  London    9000

In [87]:
# age above 20 and must be belong to londan 


# df[true hoga wahi return ] means df[ df[age wala ]  and df[city wala ] sections select our perform somethhing ]
df[(df['Age'] > 20) & (df['City'] == 'London')]

    Name  Age    City  Salary
3  Linda   23  London    9000